---
kind: enumMember
id: F:Autodesk.Revit.DB.OrdinateOriginVisibility.WitnessLineWithText
enum: Autodesk.Revit.DB.OrdinateOriginVisibility
source: html/f60c32b7-781f-94a2-9ecd-ed9e6efdbda5.htm
---
# Autodesk.Revit.DB.OrdinateOriginVisibility.WitnessLineWithText

Shows the origin witness line, tick mark and text (0'-0").